In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\akshay sonawane\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in c:\users\akshay sonawane\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\akshay sonawane\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\akshay sonawane\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\akshay sonawane\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
!pip install jupyter_contrib_nbextensions

In [8]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import seaborn as sns

In [9]:
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [10]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [11]:
df.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [14]:
df.shape[1]

6

In [16]:
df.shape[0]

78

In [18]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [20]:
df['service'].mean()

15.051282051282051

In [21]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [22]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [24]:
df.count()

rank          78
discipline    78
phd           78
service       78
sex           78
salary        78
dtype: int64

In [26]:
df.size

468

In [33]:
df.groupby('sex').max('salary')

        phd  service  salary
sex
Female   39       36  161101
Male     56       51  186960

In [45]:
print(df['salary'].max())
print(df['salary'].min())

186960
57800

In [46]:
df.iloc[1:25,1:6]

   discipline  phd  service   sex  salary
1           A   12        6  Male   93000
2           A   23       20  Male  110515
3           A   40       31  Male  131205
4           B   20       18  Male  104800
5           A   20       20  Male  122400
6           A   20       17  Male   81285
7           A   18       18  Male  126300
8           A   29       19  Male   94350
9           A   51       51  Male   57800
10          B   39       33  Male  128250
11          B   23       23  Male  134778
12          B    1        0  Male   88000
13          B   35       33  Male  162200
14          B   25       19  Male  153750
15          B   17        3  Male  150480
16          B    8        3  Male   75044
17          B    4        0  Male   92000
18          A   19        7  Male  107300
19          A   29       27  Male  150500
20          B    4        4  Male   92000
21          A   33       30  Male  103106
22          A    4        2  Male   73000
23          A    2        0  Male   85000
24          A   30       23  Male   91100

In [47]:
df['phd'].var()

156.21062271062277

In [48]:
df.salary.std()

28293.661022264165

In [51]:
df['salary'].skew()

0.45210256755588096

In [52]:
df['phd'].kurt()

0.042503564567506036